{Задание №4
Дана строка. Преобразовать все прописные русские буквы в строчные русские буквы.}
var
s:string;
begin
s:='ВЕЛОСИПЕД';
//writeln(s);
Lowercase(s);
writeln(s);
end.
